import pandas as pd

### Set operations:
- A union B
- A intersection B 
- A - B (subtraction of sets)

In [2]:
data1 = {'name':['Tony','Rama','Lakshmana'],'age':[18,32,28]}
data2 = {'name':['Rama','Lakshmana','Mounika'],'age':[32,28,25]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [3]:
df1

        name  age
0       Tony   18
1       Rama   32
2  Lakshmana   28

In [4]:
df2

        name  age
0       Rama   32
1  Lakshmana   28
2    Mounika   25

### pd.merge(df1,df2, how='outer', indicator=True)

In [5]:
pd.merge(df1, df2,) # intersection

        name  age
0       Rama   32
1  Lakshmana   28

In [6]:
pd.merge(df1, df2,
        how = 'outer') # union 
# how => {'left', 'right', 'outer', 'inner', 'cross'}, default 'inner'

        name  age
0       Tony   18
1       Rama   32
2  Lakshmana   28
3    Mounika   25

In [38]:
# pd.merge(df1, df2,
#         how = 'outer', indicator = True)

In [39]:
# pd.merge(df1, df2, 
#          how = 'outer', 
#          indicator = True).query(" _merge == 'left_only' ")

In [40]:
# df2-df1

pd.merge(df1, df2, 
         how = 'outer', 
         indicator = True).query(" _merge == 'left_only' ").drop(columns = ['_merge'])
# Rows that appear in df2 but not in df1 (set difference)

   name  age
0  Tony   18